//KALA12D JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//*  DB2 BIND JCL
//*
//BIND     EXEC PGM=IKJEFT01
//STEPLIB  DD  DISP=SHR,DSN=DSNA10.DBAG.SDSNEXIT
//         DD  DISP=SHR,DSN=DSNA10.SDSNLOAD
//DBRMLIB  DD  DSN=KALA12.DBRMLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
DSN SYSTEM (DBAG   )
BIND  MEMBER    (LNDWISE4) -
      PLAN      (KALA12A)  -
      ACTION    (REP)       -
      ISOLATION (CS)        -
      VALIDATE  (BIND)      -
      RELEASE   (COMMIT)    -
      QUALIFIER (KALA12 )  -
      ENCODING  (1047)
END
/*
