//KALA12D JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//*  COBOL DB2 RUN JCL WITH FILES
//*
//STEP00   EXEC PGM=IEFBR14
//DD1      DD DSN=KALA12.LNDW.OUTPUT,
//            DISP=(MOD,DELETE,DELETE),
//            SPACE=(TRK,(1,2)),
//            UNIT=SYSDA,
//            DCB=(DSORG=PS,RECFM=FB,LRECL=200)
//STEP01   EXEC PGM=IKJEFT01,
//             DYNAMNBR=20,REGION=4096K
//STEPLIB  DD  DISP=SHR,DSN=DSNA10.DBAG.SDSNEXIT
//         DD  DISP=SHR,DSN=DSNA10.SDSNLOAD
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//*INFILE  DD  DSN=KALA12.TACC.INPUT,DISP=SHR
//OUTFILE  DD DSN=KALA12.LNDW.OUTPUT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,2)),
//            UNIT=SYSDA,
//            DCB=(DSORG=PS,RECFM=FB,LRECL=200)
//SYSTSIN  DD  *
DSN SYSTEM (DBAG   )
  RUN PROGRAM   (LNDWISE4) -
      PLAN      (KALA12A ) -
      LIBRARY   ('KALA12.LOADLIB')
END
/*
