       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWRLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-GREETING             PIC X(20).

       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE "HELLO, WORLD!" TO WS-GREETING.
           DISPLAY WS-GREETING.
           STOP RUN.
