       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. DECOBOL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GREETING     PIC X(20) VALUE 'HELLO WORLD'.
       01 WS-COUNTER      PIC 9(4)  VALUE 1.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY WS-GREETING.
           STOP RUN.
